TodWulff/ARMbasic_Repo/_Coridium/MiClib/system_LPC175x6x.c
/*--------------------- Flash Accelerator Configuration ----------------------
//
// <e> Flash Accelerator Configuration
//   <o1.12..15> FLASHTIM: Flash Access Time
//               <0=> 1 CPU clock (for CPU clock up to 20 MHz)
//               <1=> 2 CPU clocks (for CPU clock up to 40 MHz)
//               <2=> 3 CPU clocks (for CPU clock up to 60 MHz)
//               <3=> 4 CPU clocks (for CPU clock up to 80 MHz)
//               <4=> 5 CPU clocks (for CPU clock up to 100 MHz)
//               <5=> 6 CPU clocks (for any CPU clock)
// </e>
*/
#define FLASH_SETUP           1
#define FLASHCFG_Val          0x00004000

/*
//-------- <<< end of configuration section >>> ------------------------------
*/

/*----------------------------------------------------------------------------
  Check the register settings
 *----------------------------------------------------------------------------*/
#define CHECK_RANGE(val, min, max)                ((val < min) || (val > max))
#define CHECK_RSVD(val, mask)                     (val & mask)

/* Clock Configuration -------------------------------------------------------*/
#if (CHECK_RSVD((SCS_Val),       ~0x00000030))
   #error "SCS: Invalid values of reserved bits!"
#endif

#if (CHECK_RANGE((CLKSRCSEL_Val), 0, 2))
   #error "CLKSRCSEL: Value out of range!"
#endif

#if (CHECK_RSVD((PLL0CFG_Val),   ~0x00FF7FFF))
   #error "PLL0CFG: Invalid values of reserved bits!"
#endif

#if (CHECK_RSVD((PLL1CFG_Val),   ~0x0000007F))
   #error "PLL1CFG: Invalid values of reserved bits!"
#endif

#if (PLL0_SETUP)            /* if PLL0 is used */
  #if (CCLKCFG_Val < 2)     /* CCLKSEL must be greater then 1 */
    #error "CCLKCFG: CCLKSEL must be greater then 1 if PLL0 is used!"
  #endif
#endif

#if (CHECK_RANGE((CCLKCFG_Val), 2, 255))
   #error "CCLKCFG: Value out of range!"
#endif

#if (CHECK_RSVD((USBCLKCFG_Val), ~0x0000000F))
   #error "USBCLKCFG: Invalid values of reserved bits!"
#endif

#if (CHECK_RSVD((PCLKSEL0_Val),   0x000C0C00))
   #error "PCLKSEL0: Invalid values of reserved bits!"
#endif

#if (CHECK_RSVD((PCLKSEL1_Val),   0x03000300))
   #error "PCLKSEL1: Invalid values of reserved bits!"
#endif

#if (CHECK_RSVD((PCONP_Val),      0x10100821))
   #error "PCONP: Invalid values of reserved bits!"
#endif

#if (CHECK_RSVD((CLKOUTCFG_Val), ~0x000001FF))
   #error "CLKOUTCFG: Invalid values of reserved bits!"
#endif

/* Flash Accelerator Configuration -------------------------------------------*/
#if (CHECK_RSVD((FLASHCFG_Val), ~0x0000F000))
   #error "FLASHCFG: Invalid values of reserved bits!"
#endif


/*----------------------------------------------------------------------------
  DEFINES
 *----------------------------------------------------------------------------*/
    
/*----------------------------------------------------------------------------
  Define clocks
 *----------------------------------------------------------------------------*/
#define XTAL        ( 4000000UL)        /* Oscillator frequency               */
#define OSC_CLK     (      XTAL)        /* Main oscillator frequency          */
#define RTC_CLK     (   32000UL)        /* RTC oscillator frequency           */
#define IRC_OSC     ( 4000000UL)        /* Internal RC oscillator frequency   */

/* F_cco0 = (2 * M * F_in) / N  */
#define __M               (((PLL0CFG_Val      ) & 0x7FFF) + 1)
#define __N               (((PLL0CFG_Val >> 16) & 0x00FF) + 1)
#define __FCCO(__F_IN)    ((2ULL * __M * __F_IN) / __N) 
#define __CCLK_DIV        (((CCLKCFG_Val      ) & 0x00FF) + 1)

/* Determine core clock frequency according to settings */
 #if (PLL0_SETUP)
    #if   ((CLKSRCSEL_Val & 0x03) == 1)
        #define __CORE_CLK (__FCCO(OSC_CLK) / __CCLK_DIV)
    #elif ((CLKSRCSEL_Val & 0x03) == 2)
        #define __CORE_CLK (__FCCO(RTC_CLK) / __CCLK_DIV)
    #else 
        #define __CORE_CLK (__FCCO(IRC_OSC) / __CCLK_DIV)
    #endif
 #else
    #if   ((CLKSRCSEL_Val & 0x03) == 1)
        #define __CORE_CLK (OSC_CLK         / __CCLK_DIV)
    #elif ((CLKSRCSEL_Val & 0x03) == 2)
        #define __CORE_CLK (RTC_CLK         / __CCLK_DIV)
    #else
        #define __CORE_CLK (IRC_OSC         / __CCLK_DIV)
    #endif
 #endif


/*----------------------------------------------------------------------------
  Clock Variable definitions
 *----------------------------------------------------------------------------*/

// default set to IRC until updated by SystemInit
uint32_t SystemCoreClock = IRC_OSC;  /*!< System Clock Frequency (Core Clock)*/
//uint32_t SystemCoreClock = __CORE_CLK;  /*!< System Clock Frequency (Core Clock)*/


/*----------------------------------------------------------------------------
  Clock functions	  code is 12.65
 *----------------------------------------------------------------------------*/
void SystemCoreClockUpdate (void)            /* Get Core Clock Frequency   9.59K code 11.28K data  12.22K code 11.28K data */
{
//12.22K code 11.28K data
//14.68K code 11.28K data 
//14.72K code 11.28K data
//12.07K code 11.28K data
//BASIC is 9.61K code 11.28K data
//BASIC is 12.22K code 11.28K data
//BASIC is 14.68K code 11.28K data
//BASIC is 12.07K code 11.28K data
  /* Determine clock frequency according to clock register values             */
  //if (((LPC_SC->PLL0STAT >> 24) & 3) == 3) { /* If PLL0 enabled and connected */
  //  switch (LPC_SC->CLKSRCSEL & 0x03) {
  //    case 0:                                /* Int. RC oscillator => PLL0    */
  //    case 3:                                /* Reserved, default to Int. RC  */
  //      SystemCoreClock = (IRC_OSC * 
  //                        ((2ULL * ((LPC_SC->PLL0STAT & 0x7FFF) + 1)))  /
  //                        (((LPC_SC->PLL0STAT >> 16) & 0xFF) + 1)       /
  //                        ((LPC_SC->CCLKCFG & 0xFF)+ 1));
  //      break;
  //    case 1:                                /* Main oscillator => PLL0       */
  //      SystemCoreClock = (OSC_CLK * 
  //                        ((2ULL * ((LPC_SC->PLL0STAT & 0x7FFF) + 1)))  /
  //                        (((LPC_SC->PLL0STAT >> 16) & 0xFF) + 1)       /
  //                        ((LPC_SC->CCLKCFG & 0xFF)+ 1));
  //      break;
  //    case 2:                                /* RTC oscillator => PLL0        */
  //      SystemCoreClock = (RTC_CLK * 
  //                        ((2ULL * ((LPC_SC->PLL0STAT & 0x7FFF) + 1)))  /
  //                        (((LPC_SC->PLL0STAT >> 16) & 0xFF) + 1)       /
  //                        ((LPC_SC->CCLKCFG & 0xFF)+ 1));
  //      break;
  //  }
  //} else {
  //  switch (LPC_SC->CLKSRCSEL & 0x03) {
  //    case 0:                                /* Int. RC oscillator => PLL0    */
  //    case 3:                                /* Reserved, default to Int. RC  */
  //      SystemCoreClock = IRC_OSC / ((LPC_SC->CCLKCFG & 0xFF)+ 1);
  //      break;
  //    case 1:                                /* Main oscillator => PLL0       */
  //      SystemCoreClock = OSC_CLK / ((LPC_SC->CCLKCFG & 0xFF)+ 1);
  //      break;
  //    case 2:                                /* RTC oscillator => PLL0        */
  //      SystemCoreClock = RTC_CLK / ((LPC_SC->CCLKCFG & 0xFF)+ 1);
  //      break;
  //  }
  //}
  SystemCoreClock = 100000000;

