TodWulff/ARMbasic_Repo/_Coridium/MiClib/system_LPC175x6x.c
}

/**
 * Initialize the system
 *
 * @param  none
 * @return none
 *
 * @brief  Setup the microcontroller system.
 *         Initialize the System.
 */
void SystemInit (void)
{
	
	LPC_RTC->CCR = 0x11;                 // enable the RTC counters -- but not calibration
		
	LPC_SC->FLASHCFG  = (LPC_SC->FLASHCFG & ~0x0000F000) | 0x5000;	// "safe" value works for all configurations - 6 clock access
			
			
#if (CLOCK_SETUP)                       /* Clock Setup                        */
	LPC_SC->SCS       = SCS_Val;
	if (SCS_Val & (1 << 5)) {             /* If Main Oscillator is enabled      */
	  while ((LPC_SC->SCS & (1<<6)) == 0);/* Wait for Oscillator to be ready    */
	}
	
	LPC_SC->CCLKCFG   = CCLKCFG_Val;      /* Setup Clock Divider                */
	
	LPC_SC->PCLKSEL0  = PCLKSEL0_Val;     /* Peripheral Clock Selection         */
	LPC_SC->PCLKSEL1  = PCLKSEL1_Val;
	
	LPC_SC->CLKSRCSEL = CLKSRCSEL_Val;    /* Select Clock Source for PLL0       */
	
	
#if (PLL0_SETUP)
	if ( LPC_SC->PLL0STAT & 2) {	  // PLLSTAT_CONNECT )
		LPC_SC->PLL0CON = 1;			// Enable PLL, disconnected
		LPC_SC->PLL0FEED = 0xaa;
		LPC_SC->PLL0FEED = 0x55;
	}

	LPC_SC->PLL0CON = 0;				// Disable PLL, disconnected
	LPC_SC->PLL0FEED = 0xaa;
	LPC_SC->PLL0FEED = 0x55;
	
	LPC_SC->PLL0CFG   = PLL0CFG_Val;      /* configure PLL0                     */
	LPC_SC->PLL0FEED  = 0xAA;
	LPC_SC->PLL0FEED  = 0x55;  
	
	LPC_SC->PLL0CON   = 0x01;             /* PLL0 Enable                        */
	LPC_SC->PLL0FEED  = 0xAA;
	LPC_SC->PLL0FEED  = 0x55;
	while (!(LPC_SC->PLL0STAT & (1<<26)));/* Wait for PLOCK0                    */
	
	LPC_SC->PLL0CON   = 0x03;             /* PLL0 Enable & Connect              */
	LPC_SC->PLL0FEED  = 0xAA;
	LPC_SC->PLL0FEED  = 0x55;
	while (!(LPC_SC->PLL0STAT & ((1<<25) | (1<<24))));/* Wait for PLLC0_STAT & PLLE0_STAT */
	
#endif

#if (PLL1_SETUP)
	LPC_SC->PLL1CFG   = PLL1CFG_Val;
	LPC_SC->PLL1FEED  = 0xAA;
	LPC_SC->PLL1FEED  = 0x55;
	
	LPC_SC->PLL1CON   = 0x01;             /* PLL1 Enable                        */
	LPC_SC->PLL1FEED  = 0xAA;
	LPC_SC->PLL1FEED  = 0x55;
	while (!(LPC_SC->PLL1STAT & (1<<10)));/* Wait for PLOCK1                    */
	
	LPC_SC->PLL1CON   = 0x03;             /* PLL1 Enable & Connect              */
	LPC_SC->PLL1FEED  = 0xAA;
	LPC_SC->PLL1FEED  = 0x55;
	while (!(LPC_SC->PLL1STAT & ((1<< 9) | (1<< 8))));/* Wait for PLLC1_STAT & PLLE1_STAT */
#else
	LPC_SC->USBCLKCFG = USBCLKCFG_Val;    /* Setup USB Clock Divider            */
#endif
	
	LPC_SC->PCONP     = PCONP_Val;        /* Power Control for Peripherals      */
	
	LPC_SC->CLKOUTCFG = CLKOUTCFG_Val;    /* Clock Output Configuration         */
#endif

#if (FLASH_SETUP == 1)                  /* Flash Accelerator Setup            */
	LPC_SC->FLASHCFG  = (LPC_SC->FLASHCFG & ~0x0000F000) | FLASHCFG_Val;
#endif

	LPC_RTC->RTC_AUX = 0x10;	// clear the fail flag

	SystemCoreClockUpdate();
	
	// Setup Timer0 Compare-Match Interrupt         
	// 1us prescaler timer runs at cclk = FOSC/PLL0_M 
	LPC_TIM0->PR  = SystemCoreClock/4/1000000-1;		//1 us prescaler -- assume PCLK set at 1/4
	LPC_TIM0->TC  = 0;
	LPC_TIM0->TCR = 1;//TxTCR_COUNTER_ENABLE;          // Timer0 Enable

#ifdef FOR_BASIC
	MEMCPY((void *)0x10000000, (void *)0x00000000, 48<<2);

// can do this manually but not inline for some reason	
	SCB->VTOR = 0x10000000; //assign new vector table in RAM, so interrupts can be patched by BASIC
#endif	
	
}


void IO2AD(int chan) {
	if (chan == 2) 		LPC_PINCON->PINSEL1 |= 0x00040000;	// convert AD2 from P0.25
	else if (chan == 3)	LPC_PINCON->PINSEL1 |= 0x00100000;	// convert AD3 from P0.26
   #ifdef LPC1768
	else if (chan == 0)	LPC_PINCON->PINSEL1 |= 0x00004000;	// convert AD0 from P0.23
	else if (chan == 1)	LPC_PINCON->PINSEL1 |= 0x00010000;	// convert AD1 from P0.24
   #endif	
	else if (chan == 4) LPC_PINCON->PINSEL3 |= 0x30000000;	// convert AD4 from P1.30
	else if (chan == 5)	LPC_PINCON->PINSEL3 |= 0xc0000000;	// convert AD5 from P1.31
}
